{
  "title": "Leadership & Structure",
  "introContent": "<p>Delaware DSA is a member-led organization with a democratically elected leadership team. Our chapter operates under a democratic socialist framework where all major decisions are made by the general membership at monthly meetings.</p><p>Our elected officers serve one-year terms and are responsible for implementing the decisions and priorities established by our membership. We maintain a commitment to transparency, accountability, and inclusive leadership.</p>",
  "fallbackContent": "<p>Delaware DSA is a member-led organization with a democratically elected leadership team. Our chapter is structured to ensure accountability, transparency, and member involvement at every level.</p><p>Our elected officers serve one-year terms and are responsible for implementing the decisions and priorities established by our membership.</p>",
  "chapterStructure": {
    "title": "Chapter Structure",
    "description": "Delaware DSA operates with a democratic structure designed to ensure member control and participation:",
    "structureItems": {
      "generalMembership": {
        "title": "General Membership",
        "description": "All dues-paying members in good standing have voting rights at general meetings and hold the highest decision-making authority in the chapter."
      },
      "steeringCommittee": {
        "title": "Steering Committee",
        "description": "Composed of 5 elected officers and 2 branch chairs, the Steering Committee administers chapter affairs and implements membership decisions."
      },
      "branches": {
        "title": "Geographic Branches",
        "description": "Northern Branch (New Castle County) and Southern Branch (Kent & Sussex Counties) provide regional representation and organizing."
      },
      "committees": {
        "title": "Standing Committees",
        "description": "Political Education, Communications, Membership Engagement, Red Rabbits, and Socialists-in-Office committees handle ongoing chapter functions."
      },
      "workingGroups": {
        "title": "Working Groups",
        "description": "Issue-based and identity-based working groups focus on specific campaigns including Housing Justice, Migrant Rights, and Queer Socialists."
      }
    },
    "meetingsInfo": "We hold a minimum of 4 General Meetings each year plus an annual convention. Steering Committee meetings occur regularly with 4 days notice to members. All meetings follow democratic procedures and meeting minutes are made available to ensure transparency.",
    "bylawsLinkText": "Read our complete chapter bylaws",
    "bylawsLinkHref": "/bylaws"
  },
  "leadershipCard": {
    "roleDefault": "Chapter Member",
    "nameDefault": "",
    "bioDefault": "",
    "emailDefault": ""
  },
  "officerStructure": {
    "title": "Chapter Officers",
    "description": "Our five elected officers serve one-year terms and coordinate the day-to-day operations of the chapter:",
    "officers": [
      {
        "position": "Co-chairs",
        "count": "2 positions",
        "responsibilities": "Chief executive officers who facilitate meetings, serve as public spokespersons, coordinate daily operations, and maintain communication with national DSA.",
        "requirements": "Cannot simultaneously serve as Branch Chair. Must get Steering Committee approval before acting as spokesperson."
      },
      {
        "position": "Secretary",
        "count": "1 position",
        "responsibilities": "Maintains membership lists, handles correspondence, takes meeting minutes, maintains official records, and manages the chapter's digital security systems.",
        "requirements": "Transfers all official records to successor in good condition."
      },
      {
        "position": "Treasurer",
        "count": "1 position",
        "responsibilities": "Manages chapter funds and financial records, handles reimbursements, ensures dues are current, prepares annual budget and financial reports.",
        "requirements": "All expenditures over $500 require Steering Committee approval."
      },
      {
        "position": "Membership Coordinator",
        "count": "1 position",
        "responsibilities": "Oversees membership growth and engagement, co-chairs the Member Engagement Committee, organizes inclusive recruitment with special attention to marginalized groups.",
        "requirements": "Activities must be inclusive, culturally competent, and non-oppressive."
      }
    ],
    "diversityRequirements": {
      "genderRequirement": "Two or more elected officers must be women, transgender, non-binary, or any combination of these categories.",
      "bipocRequirement": "Two or more elected officers must be Black, Indigenous, and/or People of Color (BIPOC).",
      "note": "Requirements determined solely by officers' own identification and are waived if insufficient candidates."
    }
  },
  "governanceProcess": {
    "title": "Democratic Governance",
    "description": "Our chapter operates on principles of democratic decision-making and member participation:",
    "processes": [
      {
        "title": "Elections",
        "description": "All officers and branch chairs are elected annually by chapter members. Elections use secure online voting platforms with at least 14 days for chapter elections and 7 days for branch elections."
      },
      {
        "title": "Resolutions",
        "description": "Any member in good standing can bring resolutions to General Meetings with endorsement from at least 5 chapter members and one month advance notice to the Steering Committee."
      },
      {
        "title": "Recall Process",
        "description": "Officers can be recalled through petition signed by two-thirds of voters from the previous election, followed by a supermajority vote of two-thirds to remove."
      },
      {
        "title": "Amendments",
        "description": "Bylaws can be amended with a two-thirds membership vote, 30 days advance notice, and sponsorship by at least 3% of chapter members."
      }
    ]
  }
}
